In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [3]:
import random

In [6]:
np.random.randint(3,6,(4,5))

array([[4, 3, 5, 3, 5],
       [3, 4, 5, 5, 4],
       [3, 4, 4, 4, 3],
       [4, 5, 4, 5, 4]])

In [7]:
# LETS CONVERT ENTIRE DATA SET INTO DATA FRAME

In [8]:
pd.DataFrame(np.random.randint(3,6,(4,5)))

   0  1  2  3  4
0  3  3  5  5  3
1  5  3  5  5  5
2  4  4  3  3  5
3  4  5  4  4  3

In [13]:
df=pd.DataFrame(np.random.randint(3,6,(4,5)), index=['krsna', 'radha','caitnya','gaura'],columns=['a','b','c','d','e'])

In [14]:
df

         a  b  c  d  e
krsna    5  4  5  3  4
radha    4  3  5  5  3
caitnya  5  4  5  4  4
gaura    3  3  5  3  4

In [17]:
df.loc[['caitnya','gaura'],['c','d']]      # DOUBLE BRACKETS ARE NECESSARY

         c  d
caitnya  5  4
gaura    5  3

In [24]:
df.loc[['caitnya','gaura']]

         a  b  c  d  e
caitnya  5  4  5  4  4
gaura    3  3  5  3  4

In [25]:
# create new column which holds summation of d and e column

In [44]:
df['new_column']=df['d'] + df['e']
#df['nav_column']=df.d + df.e

In [45]:
df

         a  b  c  d  e  new_column  nav_column
krsna    5  4  5  3  4           7           7
radha    4  3  5  5  3           8           8
caitnya  5  4  5  4  4           8           8
gaura    3  3  5  3  4           7           7

In [46]:
df.drop('gaura')

         a  b  c  d  e  new_column  nav_column
krsna    5  4  5  3  4           7           7
radha    4  3  5  5  3           8           8
caitnya  5  4  5  4  4           8           8

In [48]:
# AXIS=0  MEANS ROW
# AXIS = 1 MEANS COLUMN

In [ ]:
df.drop('c')        # THIS WILL SHOW ERROR

In [49]:
df.drop('c',axis=1)# CHANGE THE AXIS

         a  b  d  e  new_column  nav_column
krsna    5  4  3  4           7           7
radha    4  3  5  3           8           8
caitnya  5  4  4  4           8           8
gaura    3  3  3  4           7           7

In [50]:
#df.drop('c',axis=1, inplace=True).............# makes permanent change

In [51]:
df.values

array([[5, 4, 5, 3, 4, 7, 7],
       [4, 3, 5, 5, 3, 8, 8],
       [5, 4, 5, 4, 4, 8, 8],
       [3, 3, 5, 3, 4, 7, 7]])

In [52]:
df.values[df.values>5]

array([7, 7, 8, 8, 8, 8, 7, 7])

In [53]:
# HOW TO GET ROW AND COLUMN CORRES TO A VALUE